
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.github_repository.forked["ralph-taskmaster-ai"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_repository" "forked" {
      + allow_auto_merge            = (known after apply)
      + allow_merge_commit          = (known after apply)
      + allow_rebase_merge          = (known after apply)
      + allow_squash_merge          = (known after apply)
      + archived                    = (known after apply)
      + default_branch              = (known after apply)
      + full_name                   = "surefirev2/ralph-taskmaster-ai"
      + git_clone_url               = (known after apply)
      + has_discussions             = (known after apply)
      + has_downloads               = (known after apply)
      + has_issues                  = (known after apply)
      + has_projects                = (known after apply)
      + has_wiki                    = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = (known after apply)
      + merge_commit_message        = (known after apply)
      + merge_commit_title          = (known after apply)
      + name                        = (known after apply)
      + node_id                     = (known after apply)
      + pages                       = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = (known after apply)
      + squash_merge_commit_title   = (known after apply)
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + template                    = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
    }

  # github_branch_protection.forked_default_branch["ralph-taskmaster-ai"] will be created
  + resource "github_branch_protection" "forked_default_branch" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = (known after apply)
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "pre-commit",
            ]
          + strict   = true
        }
    }

  # null_resource.fork["ralph-taskmaster-ai"] will be created
  + resource "null_resource" "fork" {
      + id       = (known after apply)
      + triggers = {
          + "name"   = "ralph-taskmaster-ai"
          + "source" = "Th0rgal/open-ralph-wiggum"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + forked_repository_urls = {
      + ralph-taskmaster-ai = (known after apply)
    }

<!-- Sticky Pull Request Commentterraform-plan -->